app/views/ideas/index.html.erb

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."idea_id" = ? AND "reactions"."sentiment" = ?  [["idea_id", 1], ["sentiment", "Like"]]
---
                 <div class="sentiment">
                  Like (<%= idea.reactions.where(sentiment: "Like").count %>)