app/views/ideas/show.html.erb

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."idea_id" = ? AND "reactions"."sentiment" = ?  [["idea_id", 1], ["sentiment", "Like"]]
---
			<%= link_to sentiment, idea_reactions_path(@idea, sentiment: sentiment), method: :post %>
			(<%= @idea.reactions.where(sentiment: sentiment).count %>)