app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_name", "body", "idea_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "Joanna Rubi"], ["body", "I think this photo looks amazing! "], ["idea_id", 1], ["created_at", 2017-05-23 11:23:30 UTC], ["updated_at", 2017-05-23 11:23:30 UTC]]
---
  def create
    @comment = Comment.new(comment_params)
    @idea = @comment.idea(params[:id])

    respond_to do |format|
      if @comment.save