app/controllers/ideas_controller.rb

  def show
    @comments = @idea.comments.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 1]]

  def create
    @idea = current_user.ideas.build(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Joanna"], ["description", "Dang this shitzzle"], ["picture", "willspirit-sbln-226116.jpg"], ["created_at", 2017-05-23 10:27:13 UTC], ["updated_at", 2017-05-23 10:27:13 UTC]]